#+TITLE: Chess
#+AUTHOR: Rémi Louf

#+begin_src elisp :results silent :exports none
(plist-put org-format-latex-options :scale .8)
#+end_src

** TODO White win, Black win, draw

#+begin_src python :session basics :results silent
cur.execute("SELECT result FROM lichess where white_elo > 500 and black_elo > 500")
results = cur.fetchall()
#+end_src

#+begin_src python :session basics
counter = collections.Counter(results)
num_games = sum(counter.values())

ratios = {
    'White wins': counter['1-0'] /  num_games,
    'Black wins': counter['0-1'] /  num_games,
    'Draws': counter['1/2-1/2'] / num_games
}
ratios
#+end_src

#+RESULTS:
| White wins | : | 0.5005424416433711 | Black wins | : | 0.45746752919092937 | Draws | : | 0.04199002916569952 |

** As a byproduct of rating system

An indirect way to test for black-white advantage is to fit a model to predict victory and add a "white advantage" term:

#+attr_latex: :options basicstyle=\tiny\ttfamily
#+begin_src latex :results raw :exports results
\begin{align*}
  d &= S_{A} - S_{B} + \gamma + \epsilon\\
  \epsilon &\sim \operatorname{Normal}(0, \sigma^{2})
\end{align*}
#+end_src

#+RESULTS:
\begin{align*}
  d &= S_{A} - S_{B} + \gamma + \epsilon\\
  \epsilon &\sim \operatorname{Normal}(0, \sigma^{2})
\end{align*}

if $d>1$ A wins, if $d<-1$ B wins and we have a draw otherwise. We write:

#+begin_src latex :results raw :exports results
\begin{equation}
  S_{i} \sim \operatorname{Normal}(\mu_{i}, 1)
\end{equation}
#+end_src

#+RESULTS:
\begin{equation}
  S_{i} \sim \operatorname{Normal}(\mu_{i}, 1)
\end{equation}

where the $\mu_i$ share the same hyperprior. In a second time we can use a random walk to compute ratings that evolve over time.

Apparently this stuff has been known for a while. In Glickman's paper about chess rating systems we find many interesting things. The winner of a Kaggle competition showed that playing Black was equivalent to a 25-40 ELO disadvantage.

